/*Memo
 * 유저 클래스
 * 유저가 가진 캐릭터, 레벨, 장비 등등
 * 유저가 가진 장비
 * 등은 모두 JSON 데이터
 *
 * 2019_10_08
 * 에너미 스크립트 작성(FSM 작성)
 * 
 * 2019_10_09
 * 배틀 씬 구현
 * 맵 관련 툴 구현
 * 
 * 2019_10_10
 * 배틀 씬 캐릭터 배치
 * 카드 배분
 * 
 * 2019_10_16
 * 타겟팅 후 -> 스킬 사용하면 -> 역활
 * 모아서 액션
 * 키/마 구분
 * 
 * 스테이터스 개선
 * 턴 게이지 구현
 * 죽었을 때 구현
 * 
 * UI 먼저
 * 레벨업 구현
 * Map 이동
 * 
 * 죽으면 리스트를 아예 뺴준다.
 * 
 * 191029 할 것들
 * 전투 끝나면 그 위치에서 시작
 * 몬스터 잡으면 늘어남
 * 못죽이면 줄어듬
 * 로비 씬 구현
 * 
 * 
 * 
 * 
 */


 /*작업량
  * 2019_10_08
  * 캐릭터 이동, 공격, 히트 체크
  * 
  * 2019_10_09
  * 에너미랑 파티 데이터 구분
  * 게임 매니저에 데이터 저장
  * 
  * 
  * 
  */





  /*JSON용 데이터
   * 플레이어 주인공 캐릭터 데이터
   * 플레이어 동료 캐릭터 데이터
   * 플레이어 파티 데이터
   * 플레이어 인벤토리 데이터
   */

   /*Excel용 데이터
    * 클래스 스테이터스
    * 캐릭터 스테이터스
    * 캐릭터 카드 스테이터스
    * 맵 에너미 데이터
    * 
    */